## Removing duplicated data

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [2]:
dicio = {
    'column 1':[1,1,2,2,3,3,3],
    'column 2': ['a','a','b','b','c','c','c'],
    'column 3': ['A','A','B','B','C','C','C']
}

df = DataFrame(dicio)
df

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

### Finding and removing duplicated data: find and removes duplicated rows

In [3]:
df.duplicated()

In [7]:
df.drop_duplicates()

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

##### So that the removal is done in the dataframe itself

In [8]:
df.drop_duplicates(inplace = True)

In [9]:
df

   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

#### Remove duplicate data considered by columns

In [10]:
dicio = {
    'column 1':[1,1,2,2,3,3,3],
    'column 2': ['a','a','b','b','c','c','c'],
    'column 3': ['D','A','B','B','C','C','C']
}

df = DataFrame(dicio)
df

   column 1 column 2 column 3
0         1        a        D
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

In [11]:
df.drop_duplicates(['column 3'])

   column 1 column 2 column 3
0         1        a        D
1         1        a        A
2         2        b        B
4         3        c        C